#+TITLE: Org Timeline Viewer from Org Tables
* Import Org-tables into pandas
After checking a [[https://stackoverflow.com/questions/67064546/elegant-way-to-read-emacs-org-mode-tables-into-a-python-pandas-dataframe/67064574#67064574][couple]] of Stack Overflow [[https://emacs.stackexchange.com/questions/63505/how-to-open-org-mode-table-as-a-pandas-dataframe-with-column-names][articles]], it seems quite simple to import a Org-table into pandas passing it as a variable to the pd.DataFrame function.

Given we are not reading using pd.read_csv to read the CSV, we must convert date and agenda-day to dates manually.

#+begin_src python :session org-timeline-viewer :var tbl=test1 :colnames no :hlines :results replace
import pandas as pd
timeline = pd.DataFrame(tbl[1:], columns=tbl[0])
timeline['date'] = pd.to_datetime(timeline['date'])
timeline['agenda-day'] = pd.to_datetime(timeline['agenda-day'])
#+end_src

#+RESULTS:

Workaround: Org doesn't export end date, so we rename date as start_date, then add a day for the end_date.

Limitation: Dates must comply with ISO 8601 format. Right now, we can't add any kind of intervals for times or dates. Pandas will complain and it won't work.

#+begin_src python :session org-timeline-viewer
timeline.set_index('head')
timeline.rename(columns={'head':'heading','category':'orgfile','date':'start_date'}, inplace=True)
timeline['end_date'] = timeline['start_date'] + pd.Timedelta(days=1)
# TODO Debug output to be removed in the future
timeline.head()
#+end_src

#+RESULTS:
:            orgfile                        heading            type  todo  tags  ...       extra priority-l priority-n agenda-day   end_date
: 0  timestamp-test1                    Closed task  past-scheduled  DONE  tag2  ...  Scheduled:                  1099 2022-03-19 2022-03-20
: 1  timestamp-test1                    Closed task       timestamp  DONE  tag2  ...                              1000 2022-03-20 2022-03-21
: 2  timestamp-test1              Previous deadline        deadline        tag2  ...   Deadline:                  1000 2022-03-20 2022-03-21
: 3  timestamp-test1  Awesome event with time block       timestamp              ...                              1000 2022-03-22 2022-03-23
: 4  timestamp-test1   Demo scheluded date with tag       scheduled  TODO  tag1  ...  Scheduled:                  1099 2022-03-22 2022-03-23
:
: [5 rows x 12 columns]

